# 자료형

In [21]:
type(1)

int

In [22]:
type(1.0)

float

In [23]:
type('a')

str

In [24]:
type(True)

bool

In [25]:
type([1,2,3])

list

In [26]:
type({'나이':27, '이름':'김성찬', '성별':'남'})

dict

In [27]:
import pandas as pd

df = pd.DataFrame([['카리나',20000411], ['윈터',20010101], ['닝닝',20001030], ['지젤', 20021023]])
df.columns = ['이름','생년월일']

df

    이름      생년월일
0  카리나  20000411
1   윈터  20010101
2   닝닝  20001030
3   지젤  20021023

In [28]:
df2 = pd.DataFrame({'이름':['카리나', '윈터', '닝닝', '지젤'], '생년월일':[20000411, 20010101, 20001030, 20021023]})

df2

    이름      생년월일
0  카리나  20000411
1   윈터  20010101
2   닝닝  20001030
3   지젤  20021023

In [29]:
type(df)

pandas.core.frame.DataFrame

In [30]:
type(df.이름)

pandas.core.series.Series

# List

In [31]:
aespa = ['카리나', '윈터', '닝닝', '지젤']

In [32]:
aespa[0]

'카리나'

In [33]:
aespa[-1]

'지젤'

In [34]:
len(aespa)

4

In [35]:
# 슬라이싱
aespa[1:3]

['윈터', '닝닝']

In [36]:
aespa[:-1]

['카리나', '윈터', '닝닝']

In [37]:
aespa[-2:]

['닝닝', '지젤']

In [38]:
aespa.append('new')
aespa

['카리나', '윈터', '닝닝', '지젤', 'new']

# DataFrame

In [39]:
df

    이름      생년월일
0  카리나  20000411
1   윈터  20010101
2   닝닝  20001030
3   지젤  20021023

In [40]:
nationality = ['한국', '한국', '중국', '일본']

In [41]:
df['국적'] = nationality
df

    이름      생년월일  국적
0  카리나  20000411  한국
1   윈터  20010101  한국
2   닝닝  20001030  중국
3   지젤  20021023  일본

In [42]:
nat_df = pd.DataFrame(nationality, columns=['국적'])
nat_df

   국적
0  한국
1  한국
2  중국
3  일본

In [43]:
df3 = pd.concat([df2, nat_df], axis=1)
df3

    이름      생년월일  국적
0  카리나  20000411  한국
1   윈터  20010101  한국
2   닝닝  20001030  중국
3   지젤  20021023  일본

In [44]:
df4 = df3[df3.생년월일 > 20010000]
df4

   이름      생년월일  국적
1  윈터  20010101  한국
3  지젤  20021023  일본

In [45]:
df3.columns

Index(['이름', '생년월일', '국적'], dtype='object')

In [46]:
df3.columns[0]

'이름'

# 반복문

In [59]:
for i in range(5):
    print(i)

0
1
2
3
4

In [61]:
for i in range(5):
    print(i+1)

1
2
3
4
5

In [47]:
aespa = ['카리나', '닝닝', '지젤', '윈터']
for i in aespa:
    print(i)

카리나
닝닝
지젤
윈터

In [51]:
for col in df3:
    print(col)

이름
생년월일
국적

In [63]:
for i in df3['이름']:
    print(i)

카리나
윈터
닝닝
지젤

In [64]:
# quiz
for col in df3:
    for j in df3[col]:
        print(j)

카리나
윈터
닝닝
지젤
20000411
20010101
20001030
20021023
한국
한국
중국
일본

## quiz

1. year = [] 라는 빈 리스트를 만들고 각 맴버가 태어난 년도 구하기
2. year 리스트를 df3에 추가한 후 df5로 저장하기

hint 20000101 // 10000 = 2000
//연산자는 나눗셈에서 몫만 저장

In [ ]:
df

In [ ]:
df.생년월일

In [65]:
year = []
for i in range(len(df.생년월일)):
    year.append(df.생년월일[i] // 10000)

In [66]:
df['year'] = year
df

    이름      생년월일  국적  year
0  카리나  20000411  한국  2000
1   윈터  20010101  한국  2001
2   닝닝  20001030  중국  2000
3   지젤  20021023  일본  2002

# 문자열

* capitalize() 메소드는 문자열의 첫 문자를 대문자로 변경한 새로운 문자열을 생성해준다.

* upper(), lower() 메소드는 문자열의 모든 문자를 대문자 또는 소문자로 변경한 새로운 문자열을 만들어 준다. 하지만 대소문자를 구별하지 않는 문자(한글, 숫자, 특수문자 등)는 그대로 반환한다.

* strip() 메소드는 양쪽에 나타나는 특정 문자들을 제거한 새로운 문자열을 만들어 준다.

In [67]:
'aespa'.capitalize()

'Aespa'

In [68]:
'aespa'.upper()

'AESPA'

In [69]:
' aespa '.strip()

'aespa'

In [70]:
'*aespa*'.strip('*')

'aespa'

In [71]:
'aes*pa'.strip('*') # 중간에 있으면 제거 못함

'aes*pa'

In [72]:
'aes*pa'.replace('*', '')

'aespa'

In [73]:
text = '''동해물과 백두산이 마르고 닳도록
하느님이 보우하사 우리나라 만세'''

In [74]:
text.split(' ') #띄어쓰기를 기준으로 구분한 후 list로 반환

['동해물과', '백두산이', '마르고', '닳도록\n하느님이', '보우하사', '우리나라', '만세']

In [75]:
text.split('\n')

['동해물과 백두산이 마르고 닳도록', '하느님이 보우하사 우리나라 만세']

In [76]:
text2 = ['가', '나', '다', '라']

In [77]:
''.join(text2)

'가나다라'

In [78]:
' '.join(text2)

'가 나 다 라'

In [79]:
' '.join(text.split('\n')).split(' ')

['동해물과', '백두산이', '마르고', '닳도록', '하느님이', '보우하사', '우리나라', '만세']

# 함수

In [80]:
def plus(num1, num2):
    sum = num1 + num2
    return sum

plus(1,2)

3

In [81]:
def cal_age(ymd):
    year = ymd // 10000
    age = 2024 - year + 1
    return age

In [82]:
cal_age(19980402)

27

In [83]:
df3

    이름      생년월일  국적
0  카리나  20000411  한국
1   윈터  20010101  한국
2   닝닝  20001030  중국
3   지젤  20021023  일본

In [84]:
year_ls = []
for d in df3.생년월일:
    year_temp = cal_age(d)
    year_ls.append(year_temp)
    
year_ls

[25, 24, 25, 23]

In [85]:
df3['나이'] = df3.생년월일.apply(lambda x: 2024 - x//10000 + 1)

In [86]:
df3

    이름      생년월일  국적  나이
0  카리나  20000411  한국  25
1   윈터  20010101  한국  24
2   닝닝  20001030  중국  25
3   지젤  20021023  일본  23

In [87]:
df3['나이'] = df3.생년월일.apply(cal_age)
df3

    이름      생년월일  국적  나이
0  카리나  20000411  한국  25
1   윈터  20010101  한국  24
2   닝닝  20001030  중국  25
3   지젤  20021023  일본  23

In [88]:
df4 = df3.copy()
df4

    이름      생년월일  국적  나이
0  카리나  20000411  한국  25
1   윈터  20010101  한국  24
2   닝닝  20001030  중국  25
3   지젤  20021023  일본  23

In [89]:
df4.drop(columns=['나이'])

    이름      생년월일  국적
0  카리나  20000411  한국
1   윈터  20010101  한국
2   닝닝  20001030  중국
3   지젤  20021023  일본

In [90]:
df4

    이름      생년월일  국적  나이
0  카리나  20000411  한국  25
1   윈터  20010101  한국  24
2   닝닝  20001030  중국  25
3   지젤  20021023  일본  23

In [91]:
df5 = df4.drop(columns=['나이'])
df5

    이름      생년월일  국적
0  카리나  20000411  한국
1   윈터  20010101  한국
2   닝닝  20001030  중국
3   지젤  20021023  일본

In [92]:
df4.drop(columns=['나이'], inplace=True)
df4

    이름      생년월일  국적
0  카리나  20000411  한국
1   윈터  20010101  한국
2   닝닝  20001030  중국
3   지젤  20021023  일본

# QUIZ! 

아래의 DataFrame에서 [상품명, 상품코드, 상품색상, 브랜드이름, 별점, 리뷰, 유저네임, 유저레벨]로 바꾸시오~

In [96]:
import pandas as pd

musinsa = pd.read_csv('./data/practice_musinsa.csv', index_col=0)
musinsa.head()

,0,1,2,3,4
0,CORP TEE BLACK(MG2DMMT509A),MG2DMMT509ABK\n / MAHAGRID,width: 100%;,믿고입습니다 핏이 너무 좋고 무난한 반팔티에요 만족도 최상입니다,LV.3 권제로민
1,CORP TEE BLACK(MG2DMMT509A),MG2DMMT509ABK\n / MAHAGRID,width: 100%;,사이즈 딱 예쁘구 힙해서 자주 입을 거 같아용 ! 원단이 얇지는 않아요 !,LV.4 321818
2,CORP TEE BLACK(MG2DMMT509A),MG2DMMT509ABK\n / MAHAGRID,width: 100%;,옷 너무 예쁩니다 핏도 아주 잘 나오네요 감사합니다,LV.6 lcb0
3,CORP TEE BLACK(MG2DMMT509A),MG2DMMT509ABK\n / MAHAGRID,width: 100%;,프린팅이 마음에 들어서 구매했어요 사이즈 적당하고 핏도 맘에 들어오,LV.5 tjr_dl
4,CORP TEE BLACK(MG2DMMT509A),MG2DMMT509ABK\n / MAHAGRID,width: 100%;,좋아하는 연예인이 입었길래 구매했는데 생각보다 재질도 좋고 이뻐요 사이즈도 마음에 ...,LV.4 0.

In [97]:
musinsa_temp = musinsa.copy()
musinsa_temp.head()

,0,1,2,3,4
0,CORP TEE BLACK(MG2DMMT509A),MG2DMMT509ABK\n / MAHAGRID,width: 100%;,믿고입습니다 핏이 너무 좋고 무난한 반팔티에요 만족도 최상입니다,LV.3 권제로민
1,CORP TEE BLACK(MG2DMMT509A),MG2DMMT509ABK\n / MAHAGRID,width: 100%;,사이즈 딱 예쁘구 힙해서 자주 입을 거 같아용 ! 원단이 얇지는 않아요 !,LV.4 321818
2,CORP TEE BLACK(MG2DMMT509A),MG2DMMT509ABK\n / MAHAGRID,width: 100%;,옷 너무 예쁩니다 핏도 아주 잘 나오네요 감사합니다,LV.6 lcb0
3,CORP TEE BLACK(MG2DMMT509A),MG2DMMT509ABK\n / MAHAGRID,width: 100%;,프린팅이 마음에 들어서 구매했어요 사이즈 적당하고 핏도 맘에 들어오,LV.5 tjr_dl
4,CORP TEE BLACK(MG2DMMT509A),MG2DMMT509ABK\n / MAHAGRID,width: 100%;,좋아하는 연예인이 입었길래 구매했는데 생각보다 재질도 좋고 이뻐요 사이즈도 마음에 ...,LV.4 0.

In [98]:
musinsa_temp['1'][0]

'MG2DMMT509ABK\n / MAHAGRID'

In [99]:
item_code_list = []
brand_name_list = []
star_list = []
lv_list = []
nm_list = []

for i in range(len(musinsa_temp['1'])):
    item_code = musinsa_temp['1'][i].split('\n / ')[0]
    item_code_list.append(item_code)
    brand_name = musinsa_temp['1'][i].split('\n / ')[1]
    brand_name_list.append(brand_name)
    star_point = int(float(musinsa_temp['2'][i].split(':')[1].split('%')[0]) / 20)
    try:
        user = musinsa_temp['4'][i].split(' ')
        nm_list.append(user[1])
        lv = user[0].split('.')[1]
        lv_list.append(lv)
    except:
        nm_list.append('unknown')
        lv_list.append(0)
        print('error')
    
    star_list.append(star_point)

error

In [100]:
musinsa_temp['item_code'] = item_code_list
musinsa_temp['brand'] = brand_name_list
musinsa_temp['star'] = star_list
musinsa_temp['review'] = musinsa_temp['3']
musinsa_temp['nickname'] = nm_list
musinsa_temp['lv'] = lv_list
musinsa_final = musinsa_temp[['item_code','brand','star','review','nickname','lv']]

In [101]:
musinsa_final.head()

,item_code,brand,star,review,nickname,lv
0,MG2DMMT509ABK,MAHAGRID,5,믿고입습니다 핏이 너무 좋고 무난한 반팔티에요 만족도 최상입니다,권제로민,3
1,MG2DMMT509ABK,MAHAGRID,5,사이즈 딱 예쁘구 힙해서 자주 입을 거 같아용 ! 원단이 얇지는 않아요 !,321818,4
2,MG2DMMT509ABK,MAHAGRID,5,옷 너무 예쁩니다 핏도 아주 잘 나오네요 감사합니다,lcb0,6
3,MG2DMMT509ABK,MAHAGRID,5,프린팅이 마음에 들어서 구매했어요 사이즈 적당하고 핏도 맘에 들어오,tjr_dl,5
4,MG2DMMT509ABK,MAHAGRID,5,좋아하는 연예인이 입었길래 구매했는데 생각보다 재질도 좋고 이뻐요 사이즈도 마음에 ...,0.,4

In [102]:
musinsa_final.to_csv('./musinsa_final.csv')